Tekla Open API Reference for Tekla Structures 2025
StructuresFieldAttribute Properties
The StructuresFieldAttribute type exposes the following members.
Properties
Name | Description
AttributeName
 The name of the attribute.
Top
See Also
Reference
StructuresFieldAttribute Class
Tekla.Structures.Plugins Namespace